<template>
  <view class="terms-container">
    <!-- <navigation /> -->
    <!-- 服务条款/隐私协议 -->
    <view v-if="sts === 'serviceTerms'">
         欢迎您与经营者(详见定义条款) 共同签署本《平台服务协议》称本协议”并使用平台服务!   
       您在申请注册流程时应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。   
      当您按照注册页面提示填写信息、阅读本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与达成一致，成为平台用户”阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。一、定义 
        1.1上品时代:包括小程序端。    1.2上品时代:郑州上品时代企业管理有限公司    1.3 平台服务:基于互联网，以包含平台网站、客户端等在内的 各种形态(包括未来技术发展出现的新的服务形态向您提供的各项服务。 
       1.4 平台规则:包括在所有平台规则频道内已经发布及后续发布 的全部规则、实施细则、产品说明、公告等二、协议范围   2.1签约主体   本协议由您与平台经营者共同缔结，本协议对您与平台经营者均具有合同效力。   2.2
      补充协议    由于互联网高速发展，您与签署的本协议列明的条款并不能完整 罗列并覆盖您所有权利与义务，现有的约定也不能保证完全符合未来
      发展的需求。因此，平台退换货规则等均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用平台服务，视为您同意 上述补充协议。三、账户注册与使用   3.1用户资格 
      您确认，在您开始注册程序使用平台服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。   3.2 账户说明    当您按照注册页面提示填写信息、阅读并同意本协议且完成全部
      注册程序后，您可获得平台账户并成为平台用户。 您有权使用您设置 或确认的百汇E鲜购会员名、邮箱、手机号码(以下简称 账户名称” 及您设置的密码(账户名称及密码合称 账户”登录百汇 E 鲜购平台  3.3 注册信息管理 
       3.3.1 真实合法     在使用平台服务时，您应当按平台页面的提示准确完整地提供您 的信息 (包括您的姓名及电子邮件地址、联系电话、联系地址等)， 以便与您联系。您了解并同意，您有义务保持您提供信息的真实性及 有效性'
    </view>
    <view v-else>
      隐私政策 上品时代(以下称“我们”) 注重保护用户个人信息及个人隐私。本隐私条款解释了用户 (“您”)个人信息(以下称“信息”)
      收集和使用的有关情况，本隐私条款与您使用找商网提供的所有相关服务(包括但不限于电子商务、网络资讯等，以下称“找商网服务”或“服务”)息息相关，您应仔细阅读并确认您已充分理解且同意本条款内容。如果您不同意本隐私条款的任何内容，您应立即停止使用找商网服务。当您使用找商网提供的任一服务时，即表示您已同意我们按照本隐私条款来合法收集、使用和保护您的个人信息。本隐私条款包含如下内容:我们收集您的如下信息我们通过如下方式或途径收集您的信息我们通过以下方式使用您的信息四、我们在以下方面共享您的信息五、您可以通过如下方式管理您的信息六、我们通过如下措施管理保护您的信息七、Cookie
      和类似技术的使用八、我们对未成年人个人信息的保护九、修订与通知十、生效我们收集您的如下信息我们收集信息是为了向您提供更好以及更个性化的服务，并努力提高您的用户体验。个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本条款所涉包含如下信息:1、
      基本信息:包括但不限于您的姓名、性别、身份证号码、电话号码、电子邮箱、联系地址、公司信息等2、网络身份标识信息:包括但不限于找商网在线账号、IP
      地址，以及与之有关的登录账号、密码等。网络浏览记录:包括但不限于网站浏览记录、访问日期和时间、网站操作记录、点击记录、cookies
      记录等4、个人常用设备信息:包括但不限于硬件型号、操作系统类型等5、财产信息:包括但不限于账号余额、优惠券、交易记录、虚拟财产信息等。除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而获得的您的其他信息，包括您与我们的客服团队联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，以及您与找商网的关联方、找商网合作伙伴之间互动时我们获得的相关信息同时，为提高您使用找商网提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会通过了解一些您的网络使用习惯您常用的软件信息等手段来判断您账户的风险，并可能会记录一些我们认为有风险的链接(“URL》。另外，您注册找商网账户和使用服务过程中，您授权的我们可向找商网的关联方、合作伙伴所收集的相关信息，以及您授权的找商网的关联方、合作伙伴可向找商网分享相关的信息。这些信息包括但不限于您的身份信息、行为信息、交易信息、设备信息等，我们会将此类信息汇总，用于帮助找商网向您提供更好以及更加个性化的服务或更好的预防互联网欺诈。需要特别说明的是，本隐私政策不适用于其他第三方向您提供的服务，例如平台上的卖家依托平台向您提供服务时，您向卖家提供的个人信息不适用于本隐私政策。平台也可能含有到其他网站的链接，我们对那些链接网站的信息保护措施不负责任、我们通过以下方式或途径收集您的信息为了向您提供更好的服务，我们根据您所使用服务的不同，收集您与
    </view>
  </view>
</template>

<script>
export default {
  data() {
    return {
      sts: '',
    }
  },
  onLoad: function (options) {
    this.sts = options.sts
  },
  onShow() {
    uni.setNavigationBarTitle({
      title: this.sts === 'serviceTerms' ? '服务条款' : '隐私协议'
    })
  },
}
</script>

<style>
@import url("./terms-page.css");
</style>
